Repository: mosa-ali/PCA
Catalog: ios/PCA/Localizable.xcstrings
Source language: en
Languages: ar

source: Active on this device
ar: نشطة على هذا الجهاز

source: Apple approval is needed before safety controls can start.
ar: يلزم موافقة Apple قبل أن تبدأ ضوابط الأمان بالعمل.

source: Apple authorization is required before iOS protection controls can run.
ar: يلزم تفويض من Apple قبل أن تعمل ضوابط الحماية في iOS.

source: Check your safety settings
ar: تحقّق من إعدادات الأمان الخاصة بك

source: Confirm settings
ar: تأكيد الإعدادات

source: Confirm these settings
ar: تأكيد هذه الإعدادات

source: Confirms the parent-selected settings without changing them
ar: يؤكد الإعدادات التي اختارها ولي الأمر دون تغييرها

source: Emergency calling and emergency help remain available.
ar: تبقى المكالمات الطارئة والمساعدة الطارئة متاحة.

source: Enrollment
ar: التسجيل

source: Important scope note: %@
ar: ملاحظة مهمة حول النطاق: %@

source: Just turned off
ar: أُوقفت للتو

source: Native iOS foundation
ar: الأساس الأصلي لنظام iOS

source: Not active
ar: غير نشطة

source: Not available
ar: غير متاحة

source: Not yet active
ar: غير نشطة بعد

source: PCA does not read your message or call content, save camera images, or keep a readable history of exact searches.
ar: لا يقرأ PCA محتوى رسائلك أو مكالماتك، ولا يحفظ صور الكاميرا، ولا يحتفظ بسجل قابل للقراءة لعمليات البحث الدقيقة.

source: PCA may show your parent protection status, screen-time totals, selected app or website categories, and requests you send.
ar: قد يعرض PCA لولي أمرك حالة الحماية، وإجمالي وقت الشاشة، وفئات التطبيقات أو المواقع المحددة، والطلبات التي ترسلها.

source: Removal protection
ar: الحماية من الإزالة

source: Review your safety settings
ar: راجع إعدادات الأمان الخاصة بك

source: Selected age: %@
ar: الفئة العمرية المختارة: %@

source: Shows what removal protection is currently active on this device and its exact scope
ar: يعرض حماية الإزالة النشطة حاليًا على هذا الجهاز ونطاقها الدقيق

source: Starting settings
ar: إعدادات البداية

source: Starting safety: %@
ar: مستوى الأمان الابتدائي: %@

source: Stricter starting settings
ar: إعدادات بداية أكثر صرامة

source: Teen
ar: مراهق

source: This is not a claim that PCA can never be removed from this device. A parent or guardian can always remove PCA through Apple's supported Family Controls settings and account recovery path. It does not prevent an authorized adult removal action.
ar: هذا لا يعني أنه لا يمكن إزالة PCA أبدًا من هذا الجهاز. يمكن لولي الأمر دائمًا إزالة PCA من خلال إعدادات Family Controls المعتمدة من Apple ومسار استرداد الحساب. وهذا لا يمنع إجراء إزالة معتمَدًا من شخص بالغ مخوَّل.

source: This protection is not available on this device or account right now.
ar: هذه الحماية غير متاحة على هذا الجهاز أو الحساب حاليًا.

source: This protection only takes effect after a parent or guardian completes Family Controls authorization for this device. It has not been requested yet.
ar: لا تصبح هذه الحماية سارية إلا بعد إتمام ولي الأمر تفويض Family Controls لهذا الجهاز. لم يُطلب ذلك بعد.

source: This protection requires an active parent/guardian Family Controls authorization, which is not currently granted for this device.
ar: تتطلب هذه الحماية تفويض Family Controls ساريًا من ولي الأمر، وهو غير ممنوح حاليًا لهذا الجهاز.

source: This protection was active but Family Controls authorization for this device has just changed. If this was not expected, ask your parent or guardian to check Screen Time settings.
ar: كانت هذه الحماية نشطة، لكن تفويض Family Controls لهذا الجهاز تغيّر للتو. إذا لم يكن هذا متوقعًا، فاطلب من ولي أمرك مراجعة إعدادات وقت الشاشة.

source: Young child
ar: طفل صغير

source: Your parent chose these settings. Check them, then tap confirm.
ar: اختار ولي أمرك هذه الإعدادات. تحقّق منها، ثم اضغط تأكيد.

source: Your parent chose these starting settings for this device. Check them, then confirm to finish setup.
ar: اختار ولي أمرك إعدادات البداية هذه لهذا الجهاز. تحقّق منها، ثم أكِّد لإنهاء الإعداد.

source: Your parent or guardian has authorized PCA for this child account through Family Controls, so iOS currently prevents deleting this app through ordinary means.
ar: قام ولي أمرك بتفويض تطبيق PCA لحساب هذا الطفل عبر ميزة Family Controls، لذلك يمنع نظام iOS حاليًا حذف هذا التطبيق بالطرق المعتادة.
